Tekla.Structures.DirectManipulation.Adapter.LocalizationHandler
The Tekla.Structures.DirectManipulation.Adapter.LocalizationHandler class handles localization queries in a static context.

Tekla.Structures.DirectManipulation.Adapter.LocalizationHandler.LocalizationContext
The Tekla.Structures.Dialog.Localization instance performing the actual localization.

Tekla.Structures.DirectManipulation.Adapter.LocalizationHandler.#cctor
Initializes static members of the Tekla.Structures.DirectManipulation.Adapter.LocalizationHandler class.

Tekla.Structures.DirectManipulation.Adapter.LocalizationHandler.Localize(System.String)
Gets the localized value for the System.String identified by key.
key: The identifier of the System.String value to get.
Returns: The localized value for the System.String identified by key.

Tekla.Structures.DirectManipulation.Adapter.LocalizationHandler.TryLoadFile(System.String)
Tries to load the localization file located at the given path.
localizationFile: The name of the localization file to load.
Returns: True if localizationFile has successfully been loaded.

Tekla.Structures.DirectManipulation.Adapter.LocalizationHandler.DisplayUserNotification(System.String)
Displays the given message as a user notification.
message: The message to display.